loadtest/results/20260922-123858/3-mixed-95r-5w.txt
Running 1m test @ https://cache-api-alb-1567239145.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 118.922ms, rate sampling interval: 342ms
  Thread calibration: mean lat.: 118.613ms, rate sampling interval: 336ms
  Thread calibration: mean lat.: 118.583ms, rate sampling interval: 336ms
  Thread calibration: mean lat.: 107.472ms, rate sampling interval: 345ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   101.63ms   54.38ms   1.68s    93.40%
    Req/Sec   125.04     32.22   242.00     90.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   87.36ms
 75.000%   99.07ms
 90.000%  132.61ms
 99.000%  260.74ms
 99.900%  869.38ms
 99.990%    1.36s 
 99.999%    1.68s 
100.000%    1.68s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      71.295     0.000000            1         1.00
      80.127     0.100000         2528         1.11
      81.983     0.200000         5065         1.25
      83.647     0.300000         7509         1.43
      85.375     0.400000        10031         1.67
      87.359     0.500000        12501         2.00
      88.639     0.550000        13779         2.22
      90.175     0.600000        15013         2.50
      92.159     0.650000        16256         2.86
      94.783     0.700000        17493         3.33
      99.071     0.750000        18756         4.00
     101.567     0.775000        19380         4.44
     105.087     0.800000        19993         5.00
     109.503     0.825000        20620         5.71
     114.559     0.850000        21242         6.67
     121.855     0.875000        21865         8.00
     127.167     0.887500        22179         8.89
     132.607     0.900000        22490        10.00
     141.183     0.912500        22805        11.43
     149.759     0.925000        23115        13.33
     159.359     0.937500        23429        16.00
     167.807     0.943750        23584        17.78
     177.023     0.950000        23740        20.00
     187.135     0.956250        23897        22.86
     198.271     0.962500        24051        26.67
     210.559     0.968750        24208        32.00
     217.215     0.971875        24287        35.56
     225.279     0.975000        24368        40.00
     228.991     0.978125        24444        45.71
     234.879     0.981250        24522        53.33
     238.975     0.984375        24598        64.00
     243.455     0.985938        24637        71.11
     249.727     0.987500        24677        80.00
     255.231     0.989062        24715        91.43
     267.519     0.990625        24755       106.67
     283.647     0.992188        24793       128.00
     294.655     0.992969        24813       142.22
     308.479     0.993750        24833       160.00
     318.719     0.994531        24852       182.86
     342.271     0.995313        24871       213.33
     366.847     0.996094        24891       256.00
     381.183     0.996484        24901       284.44
     432.895     0.996875        24910       320.00
     491.263     0.997266        24920       365.71
     522.495     0.997656        24930       426.67
     588.287     0.998047        24940       512.00
     644.607     0.998242        24945       568.89
     711.167     0.998437        24949       640.00
     801.279     0.998633        24954       731.43
     831.999     0.998828        24959       853.33
     877.567     0.999023        24964      1024.00
     953.343     0.999121        24968      1137.78
     964.095     0.999219        24969      1280.00
    1013.759     0.999316        24971      1462.86
    1145.855     0.999414        24974      1706.67
    1155.071     0.999512        24976      2048.00
    1170.431     0.999561        24978      2275.56
    1190.911     0.999609        24979      2560.00
    1244.159     0.999658        24980      2925.71
    1269.759     0.999707        24982      3413.33
    1269.759     0.999756        24982      4096.00
    1281.023     0.999780        24983      4551.11
    1282.047     0.999805        24984      5120.00
    1282.047     0.999829        24984      5851.43
    1325.055     0.999854        24985      6826.67
    1325.055     0.999878        24985      8192.00
    1359.871     0.999890        24986      9102.22
    1359.871     0.999902        24986     10240.00
    1359.871     0.999915        24986     11702.86
    1582.079     0.999927        24987     13653.33
    1582.079     0.999939        24987     16384.00
    1582.079     0.999945        24987     18204.44
    1582.079     0.999951        24987     20480.00
    1582.079     0.999957        24987     23405.71
    1680.383     0.999963        24988     27306.67
    1680.383     1.000000        24988          inf
#[Mean    =      101.632, StdDeviation   =       54.382]
#[Max     =     1679.360, Total count    =        24988]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29901 requests in 1.00m, 10.11MB read
  Non-2xx or 3xx responses: 710
Requests/sec:    496.03
Transfer/sec:    171.74KB
------------------------------
X-Cache  HIT=24801  MISS=2990  BYPASS=1  writes=1399  http_errors=710
Cache hit ratio: 89.24%
Socket errors: connect=0 read=0 write=0 timeout=0
p50       87.36 ms
p90      132.61 ms
p99      260.74 ms
p99.9    869.38 ms