loadtest/results/20260922-123858/4-step-1000rps.txt
Running 30s test @ https://cache-api-alb-1567239145.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 971.265ms, rate sampling interval: 5926ms
  Thread calibration: mean lat.: 960.080ms, rate sampling interval: 6049ms
  Thread calibration: mean lat.: 1131.891ms, rate sampling interval: 5980ms
  Thread calibration: mean lat.: 1011.917ms, rate sampling interval: 6049ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78s     1.22s    3.81s    56.97%
    Req/Sec   290.33     31.68   337.00     41.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.36s 
 75.000%    2.79s 
 90.000%    3.08s 
 99.000%    3.50s 
 99.900%    3.72s 
 99.990%    3.79s 
 99.999%    3.81s 
100.000%    3.81s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      74.623     0.000000            1         1.00
      84.287     0.100000         2276         1.11
      91.519     0.200000         4548         1.25
     535.039     0.300000         6808         1.43
    1747.967     0.400000         9077         1.67
    2361.343     0.500000        11356         2.00
    2482.175     0.550000        12491         2.22
    2566.143     0.600000        13638         2.50
    2646.015     0.650000        14766         2.86
    2721.791     0.700000        15891         3.33
    2793.471     0.750000        17030         4.00
    2834.431     0.775000        17593         4.44
    2879.487     0.800000        18166         5.00
    2920.447     0.825000        18738         5.71
    2959.359     0.850000        19294         6.67
    3010.559     0.875000        19868         8.00
    3039.231     0.887500        20148         8.89
    3080.191     0.900000        20440        10.00
    3108.863     0.912500        20705        11.43
    3139.583     0.925000        20996        13.33
    3172.351     0.937500        21272        16.00
    3190.783     0.943750        21419        17.78
    3213.311     0.950000        21559        20.00
    3248.127     0.956250        21702        22.86
    3289.087     0.962500        21840        26.67
    3323.903     0.968750        21985        32.00
    3346.431     0.971875        22060        35.56
    3362.815     0.975000        22129        40.00
    3381.247     0.978125        22199        45.71
    3401.727     0.981250        22265        53.33
    3430.399     0.984375        22340        64.00
    3446.783     0.985938        22370        71.11
    3465.215     0.987500        22407        80.00
    3483.647     0.989062        22441        91.43
    3510.271     0.990625        22477       106.67
    3530.751     0.992188        22517       128.00
    3538.943     0.992969        22531       142.22
    3559.423     0.993750        22549       160.00
    3569.663     0.994531        22567       182.86
    3588.095     0.995313        22583       213.33
    3606.527     0.996094        22602       256.00
    3614.719     0.996484        22610       284.44
    3624.959     0.996875        22620       320.00
    3635.199     0.997266        22629       365.71
    3659.775     0.997656        22637       426.67
    3680.255     0.998047        22646       512.00
    3684.351     0.998242        22651       568.89
    3698.687     0.998437        22655       640.00
    3706.879     0.998633        22658       731.43
    3715.071     0.998828        22663       853.33
    3719.167     0.999023        22667      1024.00
    3725.311     0.999121        22670      1137.78
    3727.359     0.999219        22672      1280.00
    3729.407     0.999316        22674      1462.86
    3733.503     0.999414        22676      1706.67
    3766.271     0.999512        22678      2048.00
    3770.367     0.999561        22680      2275.56
    3774.463     0.999609        22681      2560.00
    3776.511     0.999658        22683      2925.71
    3776.511     0.999707        22683      3413.33
    3778.559     0.999756        22685      4096.00
    3778.559     0.999780        22685      4551.11
    3778.559     0.999805        22685      5120.00
    3780.607     0.999829        22686      5851.43
    3780.607     0.999854        22686      6826.67
    3794.943     0.999878        22687      8192.00
    3794.943     0.999890        22687      9102.22
    3794.943     0.999902        22687     10240.00
    3805.183     0.999915        22688     11702.86
    3805.183     0.999927        22688     13653.33
    3805.183     0.999939        22688     16384.00
    3805.183     0.999945        22688     18204.44
    3805.183     0.999951        22688     20480.00
    3809.279     0.999957        22689     23405.71
    3809.279     1.000000        22689          inf
#[Mean    =     1777.390, StdDeviation   =     1221.185]
#[Max     =     3807.232, Total count    =        22689]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29672 requests in 30.08s, 9.89MB read
  Non-2xx or 3xx responses: 5513
Requests/sec:    986.44
Transfer/sec:    336.55KB
------------------------------
X-Cache  HIT=23654  MISS=505  BYPASS=0  writes=0  http_errors=5513
Cache hit ratio: 97.91%
Socket errors: connect=0 read=0 write=0 timeout=0
p50     2361.34 ms
p90     3080.19 ms
p99     3504.13 ms
p99.9   3719.17 ms