loadtest/results/20260922-123858/4-step-250rps.txt
Running 30s test @ https://cache-api-alb-1567239145.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 130.437ms, rate sampling interval: 340ms
  Thread calibration: mean lat.: 136.014ms, rate sampling interval: 332ms
  Thread calibration: mean lat.: 131.823ms, rate sampling interval: 342ms
  Thread calibration: mean lat.: 131.321ms, rate sampling interval: 340ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    99.47ms   27.65ms 321.28ms   85.78%
    Req/Sec    62.75     62.36   150.00     70.51%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   88.00ms
 75.000%  101.31ms
 90.000%  143.62ms
 99.000%  198.53ms
 99.900%  260.35ms
 99.990%  307.97ms
 99.999%  321.54ms
100.000%  321.54ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      75.263     0.000000            1         1.00
      80.767     0.100000          511         1.11
      82.751     0.200000         1012         1.25
      84.351     0.300000         1500         1.43
      86.079     0.400000         2015         1.67
      87.999     0.500000         2502         2.00
      89.343     0.550000         2760         2.22
      90.879     0.600000         3000         2.50
      92.991     0.650000         3250         2.86
      96.575     0.700000         3506         3.33
     101.311     0.750000         3752         4.00
     104.191     0.775000         3875         4.44
     109.951     0.800000         4000         5.00
     116.031     0.825000         4126         5.71
     124.159     0.850000         4251         6.67
     133.503     0.875000         4375         8.00
     138.623     0.887500         4439         8.89
     143.615     0.900000         4500        10.00
     148.351     0.912500         4565        11.43
     152.575     0.925000         4626        13.33
     159.231     0.937500         4688        16.00
     160.767     0.943750         4722        17.78
     161.535     0.950000         4754        20.00
     163.199     0.956250         4783        22.86
     166.527     0.962500         4813        26.67
     170.111     0.968750         4844        32.00
     172.543     0.971875         4860        35.56
     175.999     0.975000         4875        40.00
     178.943     0.978125         4891        45.71
     182.911     0.981250         4907        53.33
     187.135     0.984375         4922        64.00
     188.927     0.985938         4930        71.11
     191.487     0.987500         4938        80.00
     196.223     0.989062         4946        91.43
     201.087     0.990625         4954       106.67
     204.287     0.992188         4961       128.00
     208.383     0.992969         4965       142.22
     215.423     0.993750         4969       160.00
     217.215     0.994531         4973       182.86
     223.871     0.995313         4977       213.33
     228.095     0.996094         4981       256.00
     229.631     0.996484         4983       284.44
     232.447     0.996875         4985       320.00
     236.671     0.997266         4987       365.71
     238.079     0.997656         4989       426.67
     244.735     0.998047         4991       512.00
     245.631     0.998242         4992       568.89
     246.015     0.998437         4993       640.00
     246.143     0.998633         4994       731.43
     260.351     0.998828         4995       853.33
     266.751     0.999023         4996      1024.00
     266.751     0.999121         4996      1137.78
     270.591     0.999219         4997      1280.00
     270.591     0.999316         4997      1462.86
     278.783     0.999414         4998      1706.67
     278.783     0.999512         4998      2048.00
     278.783     0.999561         4998      2275.56
     307.967     0.999609         4999      2560.00
     307.967     0.999658         4999      2925.71
     307.967     0.999707         4999      3413.33
     307.967     0.999756         4999      4096.00
     307.967     0.999780         4999      4551.11
     321.535     0.999805         5000      5120.00
     321.535     1.000000         5000          inf
#[Mean    =       99.467, StdDeviation   =       27.653]
#[Max     =      321.280, Total count    =         5000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7550 requests in 30.26s, 2.62MB read
  Non-2xx or 3xx responses: 97
Requests/sec:    249.50
Transfer/sec:     88.81KB
------------------------------
X-Cache  HIT=7004  MISS=449  BYPASS=0  writes=0  http_errors=97
Cache hit ratio: 93.98%
Socket errors: connect=0 read=0 write=0 timeout=0
p50       88.00 ms
p90      143.62 ms
p99      198.53 ms
p99.9    260.35 ms